[
    {
        "key": "renova",
        "name": "Renova Worldwide",
        "description": "renovaworldwide.com is the main retail site for Renoa Worldwide, developed using WordPress and WooCommerce. As a comprehensive e-commerce platform, it offers a seamless user experience, allowing customers to browse through an extensive range of products and complete their purchases smoothly. ",
        "role": "Worked on developing the entire MLM system, including various Bonus Crons and plugins like Customize Checkout, User Referral, Bulk Discount, etc.",
        "link": "https://renovaworldwide.com/",
        "image": "projects/renova.png",
        "tech": "wp",
        "techstack": "PHP, WordPress, WooCommerce, Gutenberg Blocks, Elementor, Cloudflare, Hubspot, Redis, PHPUnit"
    },
    {
        "key": "gizmogul",
        "name": "Gizmogul",
        "description": "Gizmogul is a marketplace where users can sell their refurbished cell phones.It empowers users to effortlessly sell their devices by guiding them through a user-friendly multistep wizard.",
        "role": "As Project Manager, I led the development of a custom vendor module, ensuring seamless integration and scalability for Gizmogul's marketplace. I collaborated with cross-functional teams to design a user-friendly multistep wizard, simplifying the device-selling process for users.",
        "link": "https://gizmogul.com/",
        "image": "projects/gizmogul.png",
        "tech": "laravel",
        "techstack": "PHP, Laravel, Mysql, Redis, jQuery, PHPUnit"
    },
    {
        "key": "urban-abode",
        "name": "Urban Abode",
        "description": "UrbanAbode is a property listing portal designed for renting and selling real estate. Users looking to purchase new properties benefit from a dedicated website for each property, allowing them to add images, 360-degree videos, detailed descriptions, and a contact form. The platform also features a robust Broker Network, enabling brokers to connect with each other and add fellow brokers to their favorite lists, fostering a collaborative and efficient real estate community.",
        "role": "Implemented the API calls to fetch properties dynamically.Created functional components for listing and displaying properties,ensuring a seamless and user-friendly experience.",
        "link": "https://www.urbanabode.com.au/",
        "image": "projects/urbanabode.png",
        "tech": "react",
        "techstack": "ReactJS, Vite, Bootstrap, REST API"
    },
    {
        "key": "renova-healthpro",
        "name": "Renova HealthPro",
        "description": "Healthpro is a custom platform designed for medical representatives to manage referrals, place bulk orders, and access tailored discounts",
        "role": "Contributed to the development of the Healthpro dashboard using ReactJS, integrating data from the WordPress API. Additionally, designed and implemented a custom order flow for Healthpro users to streamline their purchasing process.",
        "link": "https://healthpro.renovaworldwide.com/",
        "image": "projects/renova-healthpro.png",
        "tech": "react",
        "techstack": "PHP, WordPress, MySql, ReactJS, REST API, JWT Auth"
    },
    {
        "key": "nimbus",
        "name": "Nimbus Performance",
        "description": "Nimbus Performance is an e-commerce platform featuring an integrated Affiliate Management System.",
        "role": "As the Project Manager, I played a pivotal role in overseeing the development of the MLM (Multi-Level Marketing) system and the creation of affiliate portals.",
        "link": "https://nimbusPerformance.com/",
        "image": "projects/nimbus.png",
        "tech": "laravel",
        "techstack": "PHP, Laravel, MySql , Paypal, NMI Payment gateway"
    },
    {
        "key": "genesis",
        "name": "Genesis Framework",
        "description": "The Genesis Framework is a powerful, flexible, and secure WordPress theme framework developed by StudioPress. It provides a robust foundation for building custom WordPress themes, featuring clean and optimized code, responsive design, and built-in SEO capabilities.",
        "role": "Worked on framework enhancement and adding new features.Developed multiple plugins like WSI-Theme Settings, WSI-Secure, WSI-Redirect, Widgetkit, etc.",
        "link": "https://www.wsigenesis.com/",
        "image": "projects/wsigenesis.png",
        "tech": "wp",
        "techstack": "PHP, WordPress, Genesis, Theme Development, Plugin Development, WidgetKit, Gravity Forms"
    },
    {
        "key": "webtutor",
        "name": "WebTutor",
        "description": "E-tutoring platform enabling teachers to register and conduct online classes via video conferencing",
        "role": "Responsible for requirement gathering, designing database schemas, developing microservices based on project requirements, and integrating Cisco Webex API to enable video meetings and chat rooms.",
        "link": "",
        "image": "projects/webtutor.png",
        "tech": "react,node",
        "techstack": "Nodejs, Express, ReactJS, MongoDb, Cisco Webex, Rest API, Microservices"
    },
    {
        "key": "buyeasy",
        "name": "Buyeasy",
        "description": "Buyeasy is ecommerce site which has variety of products including Beverages ,Drink mixes, Pantry ,Snacks etc.Site targets wholesale users where they can purchase products in case with additional discount option",
        "role": "Integrated site template, Created the custom discount module , which provide discount on each purchased product, Created custom option where user can buy products in case with additional discount,Created custom CSV import tool, Customize cart and checkout flow Integrated Amazon S3 bucket for images and assets ",
        "link": "https://buyeasy.com/",
        "image": "projects/buyeasy.png",
        "tech": "ci",
        "techstack": "PHP, CodeIgniter, MySql, Paypal, Docker"
    },
    {
        "key": "wowi",
        "name": "Wowi Theme",
        "description": "WordPress Business theme for Real estate",
        "role": "Worked on 3rd party integration with ImmobilienScout24 and Immowelt, integrated CSS compiler, and created custom theme options",
        "link": "https://simplefox.io/work/wowi-theme/",
        "image": "projects/wowi-theme.png",
        "tech": "wp",
        "techstack": "PHP, WordPress, WPML, Theme Development, REST API"
    },
    {
        "key": "anfrageformular",
        "name": "Anfrageformular",
        "description": "Multi-Step Drag & Drop Form Builder Plugin for Wordpress",
        "role": "Worked on multiple version releases and added various form fields like select, date, and text also worked on entry listing",
        "link": "https://wordpress.org/plugins/anfrageformular/",
        "image": "projects/anfrageformular.png",
        "tech": "wp",
        "techstack": "PHP, WordPress, MySql, Plugin Development"
    },
    {
        "key": "hideway-holidays",
        "name": "Hideway Holidays",
        "description": "Hideway holiday is hotel and flight booking site which allow user to search for various hotels from US and FIJI etc.User can booking hotels, flights, transports meals.",
        "role": "Project estimation, Project Manager, Worked on flight API integration",
        "link": "https://www.hideawayholidays.com.au/",
        "image": "projects/hideway.png",
        "tech": "wp",
        "techstack": "PHP, WordPress, MySql, REST API, PayPal,WordPress Multisite, PHPUnit"
    },
    {
        "key": "newsmonk",
        "name": "NewsMonk",
        "description": "NewsMonk is a simple news site built in React, allowing users to read the latest news and filter them by various categories. It utilizes the newsapi.org API for fetching news data.",
        "role": "Site Development",
        "link": "https://github.com/swapnilghone/newsmonk",
        "image": "projects/newsmonk.gif",
        "tech": "react",
        "techstack": "Javascript, ReactJs, Bootstrap, news.org"
    },
    {
        "key": "inotebook",
        "name": "iNoteBook",
        "description": "iNoteBook is a personal notes app built using the MERN stack. It provides users with the ability to sign up or log in securely. Once logged in, users can create, view, edit, and manage their personal notes efficiently.User authentication is handled using JSON Web Tokens (JWT).",
        "role": "Full Stack Development",
        "link": "https://github.com/swapnilghone/inotebook",
        "image": "projects/inotebook.gif",
        "tech": "react,node",
        "techstack": "Javascript, ReactJs, Node, Express, MongoDB, Bootstrap"
    }
]